const br=require('banned_rooms');
const banrooms=br.banrooms['play'];

var ch=["가렌","갈리오","갱플랭크","그라가스","그레이브즈","그웬","나르","나미","나서스","노틸러스","녹턴","누누와 윌럼프","니달리","니코","다리우스","다이애나","드레이븐","라이즈","라칸","람머스","럭스","럼블","레나타 글라스크","레넥톤","레오나","렉사이","렐","렝가","루시안","룰루","르블랑","리신","리븐","리산드라","릴리아","마스터이","마오카이","말자하","말파이트","모데카이저","모르가나","문도 박사","미스 포츈","바드","바루스","바이","베이가","베인","벡스","벨코즈","볼리베어","브라움","브랜드","블라디미르","블리츠크랭크","비에고","빅토르","뽀삐","사미라","사이온","사일러스","샤코","세나","세라핀","세주아니","세트","소나","소라카","쉔","쉬바나","스웨인","스카너","시비르","신짜오","신드라","신지드","쓰레쉬","아리","아무무","아우렐리온 솔","아이번","아지르","아칼리","아크샨","아트록스","아펠리오스","알리스타","애니","애니비아","애쉬","야스오","에코","엘리스","오공","오른","오리아나","올라프","요네","요릭","우디르","우르곳","워윅","유미","이렐리아","이블린","이즈리얼","일라오이","자르반 4세","자야","자이라","자크","잔나","잭스","제드","제라스","제리","제이스","조이","직스","진","질리언","징크스","초가스","카르마","카밀","카사딘","카서스","카시오페아","카이사","카직스","카타리나","칼리스타","케넨","케이틀린","케인","케일","코그모","코르키","퀸","클레드","키아나","킨드레드","타릭","탈론","탈리야","탐 켄치","트런들","트리스타나","트린다미어","트위스티드 페이트","트위치","티모","파이크","판테온","피들스틱","피오라","피즈","하이머딩거","헤카림"];

var ch2=["시로코","호시노","시로코(라이딩)","세리카(새해)","노노미(수영복)","아야네(수영복)","호시노(수영복)","아루","히나","이오리","하루나","이즈미","히나(수영복)","이오리(수영복)","아코","치나츠(온천)","아루(새해)","무츠키(새해)","세나","이로하","마키","네루","카린","히비키","스미레","에이미","아리스","미도리","유즈","네루(바니걸)","카린(바니걸)","아스나(바니걸)","치히로","우타하(응원단)","노아","아카네(바니걸)","유우카(체육복)","히마리","히후미","츠루기","마시로","아즈사","코하루","아즈사(수영복)","츠루기(수영복)","히후미(수영복)","나츠","히나타","우이","카즈사","마리(체육복)","이즈나","와카모","카에데","미모리","츠쿠요","와카모(수영복)","시즈코(수영복)","이즈나(수영복)","치세(수영복)","사야","슌","슌(어린이)","코코나","사야(사복)","체리노","체리노(온천)","마리나","노도카(온천)","미야코","사키","미유","모에","히요리","아츠코","사오리","미사키"];

function response(room, msg, sender, isGroupChat, replier, ImageDB) {
   if(banrooms.includes(room)) return;
   if(msg=="챔뽑기"||msg=="ㅊㅃㄱ") {
        
            var t=Math.floor(Math.random()*(ch.length));
         replier.reply("["+sender+"] 님의 추천 챔피언은....\n\nㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ\n"+ch[t]+"\nㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ");
   }
   if(msg=="몰루가챠"||msg=="ㅁㄹㄱㅊ") {
        
            var t2=Math.floor(Math.random()*(ch2.length));
         replier.reply("["+sender+"] 님의 블루 아카이브 3성 뽑기 결과...\n\nㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ\n"+ch2[t2]+"\nㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ");
   }
}
